def area(a):
    '''
    Вычисляет площадь квадрата.
        Параметры:
            a (float): длина стороны квадрата
        
        Возвращаемое значение:
            float: площадь квадрата
        
        Пример вызова:
            square_area = area(4)
            # Возвращает 16
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата.
        Параметры:
            a (float): длина стороны квадрата
        
        Возвращаемое значение:
            float: периметр квадрата
        
        Пример вызова:
            square_perimeter = perimeter(4)
            # Возвращает 16
    '''
    return 4 * a